# ITemporaryGraphicsHandler Interface

---
C#Visual BasicVisual C++
Revit 2024 API
---
ITemporaryGraphicsHandler Interface
Members See Also
---
Interface class for external server of TemporaryGraphicsHandlerService.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public interface ITemporaryGraphicsHandler : IExternalServer
```

Visual Basic
---
```text
Public Interface ITemporaryGraphicsHandler _
	Inherits IExternalServer
```

Visual C++
---
```text
public interface class ITemporaryGraphicsHandler : IExternalServer
```

# See Also
ITemporaryGraphicsHandler Members
Autodesk.Revit.UI Namespace